# Quantity Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarInSystem..::..Quantity Property
RebarInSystem Class See Also
---
Identifies the number of bars in rebar set.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public int Quantity { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Quantity As Integer
	Get
```

Visual C++
---
```text
public:
property int Quantity {
	int get ();
}
```

# Remarks
Quantity is equal to NumberOfBarPositions if all the bars are included. If any bars are excluded, they are not counted in the Quantity.
# See Also
RebarInSystem Class
Autodesk.Revit.DB.Structure Namespace